In [1]:
%load_ext sql
%sql sqlite:///chinook.db

Connecting to 'sqlite:///chinook.db'

In [2]:
%%sql
SELECT EmployeeId, FirstName, LastName, Title, Email
  FROM employees
  ORDER BY EmployeeId LIMIT 5

Running query in 'sqlite:///chinook.db'

+------------+-----------+----------+---------------------+--------------------------+
| EmployeeId | FirstName | LastName |        Title        |          Email           |
+------------+-----------+----------+---------------------+--------------------------+
|     1      |   Andrew  |  Adams   |   General Manager   |  andrew@chinookcorp.com  |
|     2      |   Nancy   | Edwards  |    Sales Manager    |  nancy@chinookcorp.com   |
|     3      |    Jane   | Peacock  | Sales Support Agent |   jane@chinookcorp.com   |
|     4      |  Margaret |   Park   | Sales Support Agent | margaret@chinookcorp.com |
|     5      |   Steve   | Johnson  | Sales Support Agent |  steve@chinookcorp.com   |
+------------+-----------+----------+---------------------+--------------------------+

In [4]:
%%sql
UPDATE employees
  SET LastName = 'Smith'
  WHERE EmployeeId = 3

Running query in 'sqlite:///chinook.db'

1 rows affected.

++
||
++
++

In [5]:
%%sql
SELECT EmployeeId, FirstName, LastName, Title, Email
  FROM employees
  ORDER BY EmployeeId LIMIT 5

Running query in 'sqlite:///chinook.db'

+------------+-----------+----------+---------------------+--------------------------+
| EmployeeId | FirstName | LastName |        Title        |          Email           |
+------------+-----------+----------+---------------------+--------------------------+
|     1      |   Andrew  |  Adams   |   General Manager   |  andrew@chinookcorp.com  |
|     2      |   Nancy   | Edwards  |    Sales Manager    |  nancy@chinookcorp.com   |
|     3      |    Jane   |  Smith   | Sales Support Agent |   jane@chinookcorp.com   |
|     4      |  Margaret |   Park   | Sales Support Agent | margaret@chinookcorp.com |
|     5      |   Steve   | Johnson  | Sales Support Agent |  steve@chinookcorp.com   |
+------------+-----------+----------+---------------------+--------------------------+

In [6]:
%sql SELECT COUNT(*) FROM artists

Running query in 'sqlite:///chinook.db'

+----------+
| COUNT(*) |
+----------+
|   275    |
+----------+

In [7]:

%%sql
INSERT INTO artists (Name)
   VALUES('Bud Powell')

Running query in 'sqlite:///chinook.db'

1 rows affected.

++
||
++
++

In [9]:
%sql SELECT COUNT(*) FROM artists

Running query in 'sqlite:///chinook.db'

+----------+
| COUNT(*) |
+----------+
|   276    |
+----------+

In [10]:

%sql SELECT COUNT(*) FROM artists

Running query in 'sqlite:///chinook.db'

+----------+
| COUNT(*) |
+----------+
|   276    |
+----------+

In [11]:
%%sql
SELECT *
  FROM artists
  ORDER BY ArtistId DESC LIMIT 5

Running query in 'sqlite:///chinook.db'

+----------+------------------------------------------------------------------------------------+
| ArtistId |                                        Name                                        |
+----------+------------------------------------------------------------------------------------+
|   276    |                                     Bud Powell                                     |
|   275    |                               Philip Glass Ensemble                                |
|   274    |                                   Nash Ensemble                                    |
|   273    | C. Monteverdi, Nigel Rogers - Chiaroscuro; London Baroque; London Cornett & Sackbu |
|   272    |                               Emerson String Quartet                               |
+----------+------------------------------------------------------------------------------------+

In [12]:
Name

NameError: name 'Name' is not defined